<template>
    <div class="law-wrap">
        <menu-title :title="title"></menu-title>
        <Scroll :data="menu" class="scroll">
            <ul class="text-wrap">
                <li>
                    欢迎您使用肯德基宅急送网络订餐服务，包括但不限于通过肯德基宅急送互联网订餐网站，肯德基宅急送手机App订餐客户端，以及肯德基宅急送基于互联网或手机上网功能开发的其他订餐平台（如肯德基宅急送移动互联网订餐网站），提供的服务（以下简称"我们的服务"）。请仔细阅读本法律条款。您使用我们的服务即表示您已同意本条款。我们的服务范围可能会拓展，因此有时还会适用一些附加条款或要求。附加条款将会与相关服务一同提供，并且在您使用这些服务后，成为您与我们所达成的协议的一部分。本法律条款适用于您当前及未来使用的我们的服务。
                </li>
                <li>•
                    我们的服务中所涉及的商标、服务标志、设计、文字或图案及相关知识产权等均属百胜咨询（上海）有限公司或其关联公司（以下简称：百胜公司）所有、或已取得所有人的正式授权，受法律保护，在未取得百胜公司或有关第三方书面授权之前，任何人不得擅自使用，包括但不限于复制、复印、修改、出版、公布、传送、分发我们的服务中使用的文本、图象、影音、镜像等内容，否则将承担相应法律责任。使用我们的服务并不让您拥有我们的服务或您所访问的内容的任何知识产权。本条款并未授予您使用我们的服务中所用的任何商标、标志、设计、文字等的权利。
                </li>
                <li>•
                    我们在提供服务时将会尽到商业上合理水平的技能和注意义务，希望您会喜欢我们的服务，但有些关于服务的事项恕我们无法作出承诺。因此，在法律允许的范围内，我们的服务对信息的准确性和及时性不给予任何明示或默示的保证。我们的服务不承担因您进入或使用我们的服务而导致的任何直接的、间接的、意外的、因果性的损害责任。请使用合法软件和设备。
                </li>
                <li>•
                    您在使用我们的服务时，可以自愿选择是否提交个人信息资料。如果您提交个人信息，即表示您接受我们的服务隐私权条款，我们的服务对于您的个人信息和隐私权予以尊重和保密。您在使用我们的服务时传送的任何其他资料、信息，包括但不限于意见、客户反馈、喜好、建议、支持、请求、问题等内容，将被当作非保密资料和非专有资料处理；您的传送行为即表示您同意这些资料用作我们的调查、统计等目的而由我们无偿使用。
                </li>
                <li>•
                    我们的服务无意向18岁以下未成年人提供网络订餐服务或收集个人信息，家长或监护人应承担未成年人在网络环境下的隐私权的首要责任。请家长或监护人对其子女或被监护人使用我们的服务进行监管和负责。由于我们的服务无法辨认用户是否为未成年人，因此如有未成年人使用我们的服务，则表示其已获得家长或监护人认可，任何相关后果由其家长或监护人承担。
                </li>
                <li>•
                    我们的服务无意向18岁以下未成年人提供网络订餐服务或收集个人信息，家长或监护人应承担未成年人在网络环境下的隐私权的首要责任。请家长或监护人对其子女或被监护人使用我们的服务进行监管和负责。由于我们的服务无法辨认用户是否为未成年人，因此如有未成年人使用我们的服务，则表示其已获得家长或监护人认可，任何相关后果由其家长或监护人承担。
                </li>
            </ul>
        </Scroll>
    </div>
</template>

<script>
  import Scroll from 'base/scroll/scroll'
  import MenuTitle from 'base/menu-title/menu-title'
  export default {
    data() {
      return {
        title: '法律条款',
        menu: [0]
      }
    },
    components: {
      MenuTitle, Scroll
    }
  }
</script>

<style lang="less" rel="stylesheet/less">
    .law-wrap {
        background: #fff;
        font-size: 20px;
        position: absolute;
        overflow: hidden;
        width: 100%;
        top: 0;
        bottom: 0;
        z-index: 10;
        .scroll{
            position: absolute;
            top:44px;
            bottom: 0;
            z-index: 10;
            overflow: hidden;
            .text-wrap {
                padding: 0 20px;
                li {
                    margin: 10px 0;
                    font-size: 13px;
                    color: #6c6c6c;
                    line-height: normal;
                }
            }
        }

    }
</style>